
<#
#̷𝓍   𝓐𝓡𝓢 𝓢𝓒𝓡𝓘𝓟𝓣𝓤𝓜
#̷𝓍   🇵​​​​​🇴​​​​​🇼​​​​​🇪​​​​​🇷​​​​​🇸​​​​​🇭​​​​​🇪​​​​​🇱​​​​​🇱​​​​​ 🇸​​​​​🇨​​​​​🇷​​​​​🇮​​​​​🇵​​​​​🇹​​​​​ 🇧​​​​​🇾​​​​​ 🇬​​​​​🇺​​​​​🇮​​​​​🇱​​​​​🇱​​​​​🇦​​​​​🇺​​​​​🇲​​​​​🇪​​​​​🇵​​​​​🇱​​​​​🇦​​​​​🇳​​​​​🇹​​​​​🇪​​​​​.🇶​​​​​🇨​​​​​@🇬​​​​​🇲​​​​​🇦​​​​​🇮​​​​​🇱​​​​​.🇨​​​​​🇴​​​​​🇲​​​​​
#>  



[CmdletBinding()]
Param
(
    [Parameter(Position = 0,Mandatory=$true, HelpMessage="Pattern to search for")]
    [Object]$Pattern,
    [Parameter(Mandatory=$false)]
    [string]$Path="$PSScriptRoot"
    
)   
#,"bower_components"
$Excludes = @("_site","jekyll-cache","assets_v1","jekyll-metadata")
Search-Pattern -Path "$Path" -Pattern $Pattern -Exclude $Excludes 